#Написати клас Pizza.
#Кожна піца буде характеризуватися своїм набором інгредієнтів (кожен інгредієнт - це просто рядок з назвою, 
#набір - це масив таких рядків), діагоналлю та номером замовлення. Цей набір повинен зберігатися у змінній ingredients.
#Кожній піці при створенні дається унікальний номер, який зберігається у змінній number (для цього треба 
#створити змінну класу count, в яку записувати кількість створених екземплярів і використати її для цього номеру).
#Діагональ зберігається у змінній d.
#При створенні екземпляру класу задається тільки діагональ піци. Масив інгредієнтів при цьому створюється порожній.
#      Написати сетер для встановлення інгредієнтів.
#      Написати гетер для отримання діагоналі піци.
#      Заборонити можливість змінювати діагональ після створення піци.

#Написати метод description, який повертав би рядкове представлення піци у вигляді
#Піца № <номер_піци> (діагональ = <значення_діагоналі>) містить [<інгредієнт_1>, ..., <інгредієнт_n>].
#Наприклад,
#pizza1 = Pizza.new(24)
#puts pizza1.description => Піца № 1 (діагональ = 24) містить [].
#pizza1.ingredients = [‘mushroom’]
#puts pizza1.description => Піца № 1 (діагональ = 24) містить [mushroom].
#puts pizza1.number => 1
# pizza1.d = 2 => помилка NoMethodError

