#Нехай ми хочемо перевірити, чи знає користувач, на які числа ділиться задане число, 
#крім самого числа, що зберігається у змінній divider. 
#Задайте цій змінній значення 21.
#Написати програму, яка б просила ввести з консолі число, що ділиться на divider. 
#Запрошення має бути у вигляді 
#Введіть число, яке буде ділитися на divider : (замість divider має виводитися значення самої змінної). 
#Користувач після запрошення має в тому ж рядку (згадайте, для чого метод print) 
#ввести будь-яке число, що на його думку ділиться на divider.
#Дати можливість вводити не більше 5 разів. 
#Якщо користувач на протязі 5 разів неправильно введе число, то вивести інформацію, 
#що кількість спроб закінчилася.

# Ще вариант:
#divider = 21
#count = 0
#while count < 5
 #   count += 1
  #  print"Введіть число, яке буде ділитися на #{divider} : "
   # num = gets.strip.to_i
    #if num % divider == 0 && num != divider
      #  puts"Чудово"
     #   break
    #elsif num == divider
     #   puts"Число не повинно дорівнювати #{divider}"
    #elsif num % divider != 0 && count < 5
     #   puts"Невірно. Спробуйте ще раз"
    #elsif num % divider != 0 && count == 5
   #     puts"Невірно. Спробуйте ще раз"
  #      puts"Кількість спроб завершилася :("
 #   end
#end

divider = 21
counter = 0
loop do
print "Введіть число, яке буде ділитися на #{divider} : "
num = gets.strip.to_i
    if (num != divider) && (num % divider == 0)
    puts "Чудово"
    break
    elsif (num != divider) && (num % divider != 0)
    puts "Невірно. Спробуйте ще раз"
    counter +=1
    else
    puts "Число не повинно дорівнювати #{divider}"
    counter +=1
    end
    if counter == 5
    puts "Кількість спроб завершилася :("
    break
    end
 end