#Створити метод rectangle_length для обчислення периметру прямокутника (квадрата). 
#Метод має приймати два параметри – a, b – сторони прямокутника (числа).
#Передбачити наступні перевірки всередині методу:
#Параметри a i b мають бути додатними числами і не рівні нулю, якщо ж хоча б один із параметрів 
#не відповідає цій вимозі, як результат виконання методу повернути значення nil
#Якщо параметри a i b більші за 0 (нуль), то обчислити і повернути як результат виконання 
#методу периметр прямокутника за відомим співвідношенням p = 2 * (a + b)

#def rectangle_length(a, b)
#return 2 * (a + b) if a > 0 && b > 0
#return nil
#end
#puts(rectangle_length(11, 6))
____________________________________
def rectangle_length(a, b)
    (a > 0 && b > 0) ? 2 * (a + b) : nil
  end

  ____________________________________
def rectangle_length(a, b)
    if a > 0 && b > 0 then p = 2 * (a + b)
    else nil
    end
end
puts(rectangle_length(11, 6))